Repository: dsmrreader/dsmr-reader
Catalog: docs/_locale/*/LC_MESSAGES/reference/api.po
Languages: nl

source: The application has an API allowing you to insert/create readings and retrieve statistics.
nl: De applicatie heeft een API waarmee metingen kunt aanmaken/opvragen en diverse statistieken uitlezen.

source: Contents
nl: Inhoudsopgave

source: Changelog
nl: Wijzigingenoverzicht

source: Added new endpoint to create day statistics
nl: Nieuw endpoint toegevoegd voor handmatig aanmaken dagstatistieken

source: Added new endpoint for application monitoring
nl: Nieuw endpoint toegevoegd voor applicatie-monitoring

source: Removed ``/api/v2/application/status``
nl: Verwijderd: ``/api/v2/application/status``

source: Documentation
nl: Documentatie

source: The API-documentation has been moved to your local installation since DSMR-reader ``v3.1``.
nl: De API-documentatie is sinds DSMR-reader ``v3.1`` verplaatst naar je lokale installatie.

source: You can access it by selecting the ``About & Support`` menu item in DSMR-reader.
nl: Je kunt deze bekijken door het menu-item ``Over & ondersteuning`` te selecteren in DSMR-reader.

source: Configuration
nl: Configuratie

source: Enable API
nl: API inschakelen

source: The API is disabled by default in the application. You may enable it :doc:`in the configuration</tutorial/configuration>`.
nl: De API is standaard uitgeschakeld. Je kunt deze :doc:`in de configuratie</tutorial/configuration>` inschakelen.

source: API key
nl: API-sleutel

source: A random API key is generated for you by default. You can always view or update it :doc:`in the configuration</tutorial/configuration>`.
nl: Standaard wordt een willekeurige API-sleutel voor je gegenereerd. Je kunt deze altijd bekijken of bijwerken :doc:`in de configuratie</tutorial/configuration>`.
