Repository: dsmrreader/dsmr-reader
Catalog: docs/_locale/*/LC_MESSAGES/reference/faq.po
Languages: nl

source: FAQ (Frequently Asked Questions)
nl: FAQ (veelgestelde vragen)

source: Contents
nl: Inhoudsopgave

source: Troubleshooting
nl: Hulp bij problemen

source: If anything happens to fail or malfunction, please follow the steps below first to provide some background information when reporting an issue.
nl: Wanneer er iets lijkt mis te gaan, volg de onderstaande stappen eerst, voordat je een issue aanmaakt. Hiermee kun je wat meer achtergrondinformatie aanleveren.

source: Debug info dump for GitHub issues
nl: Debug-informatiedump voor GitHub-issues

source: Added the ``dsmr_debuginfo`` command for command line.
nl: Het ``dsmr_debuginfo`` commando toegevoegd voor de command line.

source: Added the ``dsmr_debuginfo`` feature to About & Support page.
nl: De ``dsmr_debuginfo`` feature toegevoegd aan de Over & Ondersteuning-pagina.

source: You can supply additional debug info by executing the ``dsmr_debuginfo`` command and copying its output into your issue on GitHub.
nl: Je kunt extra debug-informatie aanleveren door het ``dsmr_debuginfo``-commando uit te voeren en vervolgens de output daarvan te kopieren naar je issue op GitHub.

source: To do so you can either execute ``./manage.py dsmr_debuginfo`` on the command line or (since v4.6) click the button on the About & Support page.
nl: Om dit te doen kun je ofwel ``./manage.py dsmr_debuginfo`` op de command line uitvoeren, of (sinds v4.6) op de knop klikken in de Over & Ondersteuning-pagina.

source: Log files
nl: Logbestanden

source: Always start by checking the log files for errors.
nl: Je startpunt is altijd het bekijken van de logfiles voor foutmeldingen.

source: DSMR-reader technically consists of these processes (some may or may not be used by you) and they are watched by Supervisor:
nl: DSMR-reader bestaat technisch uit deze processen (sommigen zullen wel of niet in je eigen situatie gebruikt worden) en ze worden beheerd door Supervisor:

source: Each has its own log file(s):
nl: Elk heeft eigen logbestand(en):

source: The logfiles may be stale due to rotation. To see all logs for a process, try tailing a wildcard pattern, e.g.::
nl: De logbestanden kunnen blijven hangen wegens rotatie. Probeer te tailen op een wildcard-patroon om alles logs van een proces te zien. Bijvoorbeeld::

source: You can view the status of all processes by running::
nl: Je kunt de status van alle processen bekijken door het volgende uit te voeren::

source: Any processes listed, should have the status ``RUNNING``. Stale or crashed processes can be restarted with::
nl: Elk proces dat getoond wordt zou de status ``RUNNING`` moeten hebben. Hangende of gecrashde processen kunnen herstart worden met::

source: Or to restart them all simultaneously::
nl: Of herstart ze allemaal tegelijkertijd::

source: If the processes do run, but you cannot find an error, (e.g.: things seem to hang or tend to be slow), there might be another issue at hand.
nl: Wanneer de processen lijken te draaien, maar je kunt geen fout vinden (bijvoorbeeld als telegrammen hangen of de verwerking traag lijkt), dan is er waarschijnlijk iets anders aan de hand.

source: DSMR-reader has DEBUG-logging, which makes the system log very verbosely about what it's trying to do. This applies **specifically** to the ``dsmr_backend`` process.
nl: DSMR-reader heeft DEBUG-logging, waarmee het systeem heel letterlijk logt wat het aan het doen is. Dit geldt **specifiek** voor het ``dsmr_backend`` proces.

source: Errors are likely to be logged at all times, no matter the DEBUG-logging level used. Debugging is only helpful to watch DSMR-reader's detailed behaviour.
nl: Fouten worden doorgaans altijd gelogd, ongeacht het logging niveau van DEBUG-level of niet. Debugging is alleen nuttig om het gedrag van DSMR-reader in meer detail te observeren.

source: The DEBUG-logging is disabled by default, to reduce writes on the filesystem. You can enable the logging by following these steps:
nl: De DEBUG-logging is standaard uitgeschakeld, om het aantal schrijfacties op het bestandssysteem te beperken. Je kunt het inschakelen door deze stappen te volgen:

source: Make sure you are ``dsmr`` user by executing::
nl: Zorg ervoor dat je ``dsmr`` gebruiker bent door dit uit te voeren::

source: Open the ``.env`` file and look for the code below::
nl: Open ``.env`` en zoek de onderstaande code::

source: Now remove the ``###`` from this line::
nl: Verwijder nu de ``###`` uit de regel::

source: It should now be::
nl: Het zou nu dit moeten zijn::

source: After editing the file, all processes need to be restarted to reflect the change. Go back to the **root user or sudoer** with::
nl: Na het bewerken van het bestand zul je alle processen moeten herstarten om de wijziging door te voeren. Ga terug naar de **root of sudo-gebruiker** met::

source: And restart::
nl: En herstart::

source: All done!
nl: Klaar!

source: Application management
nl: Applicatiebeheer

source: How to upgrade?
nl: Hoe upgrade ik?

source: Every once in a while there may be updates. You can also easily check for updates by using the application's Status page.
nl: Met enige regelmaat zijn er updates beschikbaar. Je kunt dit ook eenvoudig controleren op de Status-pagina van de applicatie.

source: First, **please make sure you have a recent backup of your database**!
nl: Allereerst, **zorg ervoor dat je een recente backup hebt van je database**!

source: You can update your application to the latest version by executing ``deploy.sh``, located in the root of the project. Make sure to execute it while logged in as the ``dsmr`` user::
nl: Je kun je applicatie bijwerken door het script ``deploy.sh`` uit te voeren, die in zich in de hoofdmap van het project bevindt. Zorg er wel voor dat je ingelogd bent als ``dsmr`` gebruiker op de terminal::

source: How to downgrade?
nl: Hoe downgrade ik?

source: If for some reason you need to downgrade the application, you will need to:
nl: Wanneer je om wat voor reden dan ook de applicatie moet downgraden, dan zul je:

source: unapply database migrations.
nl: de databasemigraties moeten terugdraaien.

source: switch the application code version to a previous release.
nl: de applicatiecode moeten wisselen naar een vorige versie.

source: Each release `has it's database migrations locked <https://github.com/dsmrreader/dsmr-reader/tree/v4/dsmrreader/provisioning/downgrade/>`_. You should execute the script of the version you wish to downgrade to. And the switch the code to the release.
nl: Elke release `heeft z'n eigen databasemigraties vastgelegd <https://github.com/dsmrreader/dsmr-reader/tree/v4/dsmrreader/provisioning/downgrade>`_. Je zult het script moeten uitvoer voor de release waar je naar toe wilt. En vervolgens de codebase wisselen naar dezelfde release.

source: For example ``v4.0``::
nl: Bijvoorbeeld ``v4.0``::

source: Unapplying the database migrations may take a while.
nl: Het terugdraaien van databasemigraties kan wat tijd in beslag nemen.

source: You should now be on the targeted release.
nl: Je zou nu op de gewenste release moeten zitten.

source: How to restart?
nl: Hoe herstart ik?

source: You might want or need to restart DSMR-reader manually at some time. E.g.: Due to altered settings that need to be reapplied to the processes.
nl: Kan het voorkomen dat je DSMR-reader wilt of moet herstarten. Bijvoorbeeld vanwege instellingen die een herstart vereisen.

source: For a soft restart::
nl: Voor een zachte herstart::

source: For a hard restart::
nl: Voor een harde/geforceerde herstart::

source: How to uninstall?
nl: Hoe de√Ønstalleer ik?

source: To remove DSMR-reader from your system, execute the following commands::
nl: Om DSMR-reader van je systeem te verwijderen, voer het volgende uit::

source: To delete your data (the database) as well::
nl: Om ook je data (de database) te verwijderen::

source: Optionally, you can remove these packages::
nl: Eventueel kun je deze packages ook verwijderen::

source: How do I set admin credentials?
nl: Hoe stel ik de inloggegevens van de admin in?

source: There is no default user or password. You will need to set it yourself with the steps below, depending on whether you've installed manually or using Docker.
nl: Er zijn geen standaard inloggegevens. Je zult deze zelf moeten instellen met de stappen hieronder, afhankelijk van of je een handmatige installatie gedaan hebt of via Docker.

source: Manual installation
nl: Handmatige installatie

source: Now execute::
nl: Voer uit::

source: Did it error with ``Error: That username is already taken.``? Then try::
nl: Kwam er een foutmelding met ``Error: That username is already taken.``? Probeer dan::

source: The user should be created (or its password should be reset).
nl: De gebruiker is nu aangemaakt (of het wachtwoord is bijgewerkt).

source: Docker installation
nl: Docker-installatie

source: The ``DSMRREADER_ADMIN_USER`` and ``DSMRREADER_ADMIN_PASSWORD`` :doc:`as defined in Env Settings<../env_settings>` will be used for the credentials.
nl: De ``DSMRREADER_ADMIN_USER`` en ``DSMRREADER_ADMIN_PASSWORD`` :doc:`zoals gespecificeerd in Env-instellingen<../env_settings>` worden gebruikt als inloggegevens.

source: Creating or updating credentials:
nl: Inloggegevens aanmaken of bijwerken:

source: Configure ``DSMRREADER_ADMIN_USER`` and ``DSMRREADER_ADMIN_PASSWORD`` of the :doc:`Env Settings<env_settings>`.
nl: Stel ``DSMRREADER_ADMIN_USER`` en ``DSMRREADER_ADMIN_PASSWORD`` in via de :doc:`Env-instellingen<env_settings>`.

source: The user should now either be created or the existing user should have its password updated.
nl: De gebruiker is nu ofwel aangemaakt ofwel het wachtwoord is bijgewerkt.

source: How do I resolve the warning regarding database size?
nl: Hoe los ik de waarschuwing op m.b.t. de databasegrootte?

source: You will need to reduce the amount of incoming data and also enable a data retention policy.
nl: Je zult de hoeveelheid inkomende gegevens moeten beperken en tevens een dataretentiebeleid moeten instellen.

source: First increase the datalogger sleep in the configuration panel. Make sure it's at least 5 or 10 seconds.
nl: Verhoog allereest de datalogger-sleep in het configuratiepaneel. Zet deze op tenminste 5 a 10 seconden.

source: Secondly, enable data retention policy in the configuration as well. A recommended setting is having DSMR-reader clean up data after a week or month.
nl: Daarnaast zul je een dataretentiebeleid moeten instellen in het configuratiepaneel. Een aanbevolen instelling is om DSMR-reader na een week of maand de gegevens te laten opschonen.

source: After a few hours or days (depending on your hardware) the data should been reduced. Depending on the amount of data deleted, you might want to execute a one-time ``vacuumdb`` afterwards. See below for more information.
nl: Na verloop van tijd (enkele uren tot dagen, afhankelijk van je hardware) zou de data opgeschoond moeten zijn. Afhankelijk van de hoeveelheid verwijderde metingen, kun je overwegen om daarna eenmalig een ``vacuumdb`` uit te voeren. Zie hieronder voor meer informatie.

source: How do I reclaim database disk space?
nl: Hoe krijg ik schijfruimte terug?

source: This will only make a difference if you've enabled data cleanup retroactively, resulting in roughly more than a 25 percent data deletion of your entire database.
nl: Dit gaat alleen een verschil maken wanneer je dataopschoning met terugwerkende kracht hebt ingeschakeld, waardoor grofweg meer dan 25 procent van de gegevens in je database zijn verwijderd.

source: Assuming you are using the default database, PostgreSQL, you may want to try a one-time vacuum by executing::
nl: Er vanuitgaande dat je de standaarddatabase gebruikt, PostgreSQL, kun je het volgende eenmalig uitvoeren::

source: If there was any disk space to reclaim, the effect should be visible on the filesystem now.
nl: Mocht er schijfruimte vrij te maken zijn, dan zou je dat nu moeten zien op het bestandssysteem.

source: How do I change the database location?
nl: Hoe verplaats ik de databaseopslag?

source: Changing the database data location may cause data corruption. Only execute the step below if you understand exactly what you are doing!
nl: Het wijzigen van de dataopslag breng het gevaar van datacorruptie met zich mee. Voer onderstaande stappen alleen uit als je begrijpt wat je doet!

source: Since the SD-card is quite vulnerable to wearing and corruption, you can run the database on a different disk or USB-stick. To do this, you will have to stop the application and database, change the database configuration, move the data and restart all processes again.
nl: Gezien de SD-kaart gevoelig is voor slijtage en corruptie, kun je ervoor kiezen om de database op een andere disk of USB-stick te draaien. Om dit te realiseren zul je de applicatie en database moeten stoppen, de databaseconfiguratie aanpassen, dataopslag verplaatsen en alles weer opstarten.

source: Make sure the OS has direct access the new location and **create a back-up first**!
nl: Zorg ervoor dat het OS toegang heeft tot de nieuwe locatie en **maak eerst een back-up**!

source: In the example below we will move the data from ``/var/lib/postgresql/`` to ``/data/postgresql/`` (which could be an external mount).
nl: In onderstaand voorbeeld verplaatsen we de dataopslag van ``/var/lib/postgresql/`` naar ``/data/postgresql/`` (wat bijvoorbeeld op een externe disk zou kunnen zijn).

source: *Please note that "9.5" in the example below is just the version number of the database, and it may differ from your installation. The same steps however apply.*
nl: *N.B.: "9.5" in onderstaand voorbeeld is slechts het versienummer van de database en kan afwijken van je eigen situatie. Je kunt echter gewoon dezelfde stappen uitvoeren.*

source: Execute the commands below:
nl: Voer de onderstaande commando's uit:

source: Confirm that the database has stopped, you should see no more ``postgresql`` processes running: ``sudo ps faux | grep postgres``
nl: Controleer dat de database gestopt is, je zou geen processen meer moeten zien van ``postgresql`` met: ``sudo ps faux | grep postgres``

source: Ensure the new location exists: ``sudo mkdir /data/postgresql/``
nl: Zorg ervoor dat de nieuwe locatie bestaat: ``sudo mkdir /data/postgresql/``

source: Move the database data folder: ``sudo mv /var/lib/postgresql/9.5/ /data/postgresql/9.5/``
nl: Verplaats nu de gehele data-map van de database: ``sudo mv /var/lib/postgresql/9.5/ /data/postgresql/9.5/``

source: Make sure the ``postgres`` user has access to the new location (and any parent folders in it's path): ``sudo chown -R postgres:postgres /data/``
nl: Zorg ervoor dat de ``postgres`` gebruiker toegang heeft tot de nieuwe locatie (en eventuele bovenliggende mappen in het pad): ``sudo chown -R postgres:postgres /data/``

source: Edit database configuration ``sudo vi /etc/postgresql/9.5/main/postgresql.conf`` and find the line::
nl: Open de databaseconfiguratie met ``sudo vi /etc/postgresql/9.5/main/postgresql.conf`` en vind de volgende regel::

source: Change it to your new location::
nl: Wijzig het naar de nieuwe locatie::

source: Save the file and start the database: ``sudo systemctl start postgresql``
nl: Sla het bestand op en start de database weer: ``sudo systemctl start postgresql``

source: Check whether the database is running again, you should see multiple processes: ``sudo ps faux | grep postgres``
nl: Controleer of de database weer draait, je zou nu meerdere processen moeten zien: ``sudo ps faux | grep postgres``

source: Does the database not start? Check its logs in ``/var/log/postgresql/`` for hints.
nl: Wil de database niet starten? Bekijk dan de logs in ``/var/log/postgresql/`` voor hints.

source: Start DSMR-reader again: ``sudo supervisorctl start all``
nl: Start DSMR-reader weer met: ``sudo supervisorctl start all``

source: Everything should work as usual now, storing the data on the new location.
nl: Alles zou weer moeten werken zoals voorheen, met de data voortaan op een andere locatie.

source: How do I enable MySQL timezone support?
nl: Hoe zet ik tijdzone-ondersteuning aan voor MySQL?

source: `Check these docs <https://dev.mysql.com/doc/refman/5.7/en/mysql-tzinfo-to-sql.html>`_ for more information about how to enable timezone support on MySQL.
nl: `Zie deze documentatie <https://dev.mysql.com/doc/refman/5.7/en/mysql-tzinfo-to-sql.html>`_ over hoe je tijdzone-ondersteuning inschakelt op MySQL.

source: On recent versions it should be as simple as executing the following command as root/sudo user::
nl: Op recente versies kun je simpelweg het volgende commando als root/sudo-gebruiker uitvoeren::

source: How do I restore a backup?
nl: Hoe zet ik een back-up terug?

source: Only follow these step if you want to restore a backup in PostgreSQL.
nl: Voer deze stappen alleen uit wanneer je een database back-up in PostgreSQL wilt terugzetten.

source: Restoring a backup will replace any existing data stored in the database and is irreversible!
nl: Het terugzetten van een back-up overschrijft alle bestaande data en is onomkeerbaar!

source: This assumes you've **not yet** reinstalled DSMR-reader and created an **empty** database::
nl: Dit gaat er van uit dat je DSMR-reader **nog niet** helemaal geinstalleerd/draaiend hebt en daarbij alleen een **lege** database hebt aangemaakt::

source: Do **not** restore your database if you've either **started the application** and/or ran ``manage.py migrate`` in some way.
nl: Zet **niet** je database terug wanneer je ofwel **de applicatie (weer) gestart hebt** ofwel wanneer je al ``manage.py migrate`` hebt uitgevoerd.

source: Doing so WILL cause trouble with duplicate data/ID's and break your installation at some point.
nl: Doorgaan zorgt er gegarandeerd voor dat er problemen komen met dubbele gegevens/ID's op een bepaald moment.

source: To be clear, we'll repeat it once again:
nl: On glashelder te zijn, herhalen we:

source: Compressed (default)
nl: Gecomprimeerd (standaard)

source: To restore a compressed backup (``.gz``), run::
nl: Om een gecomprimeerde back-up (``.gz``) terug te zetten, voer dit uit::

source: Uncompressed (legacy)
nl: Ongecomprimeerd (legacy)

source: To restore an uncompressed backup (``.sql``), run::
nl: Om een ongecomprimeerde back-up (``.sql``) terug te zetten, voer dit uit::

source: Result
nl: Resultaat

source: You should **not** see any errors regarding duplicate data or existing ID's or whatever.
nl: Je zou **geen** fouten moeten zien m.b.t dubbele gegevens en/of bestaande ID's of iets soortgelijks.

source: If you do encounter errors while restoring the backup in an **empty** database, create an issue at GitHub and **do not continue**.
nl: Mocht je bij het terugzetten van de back-up in een **lege** database toch fouten tegenkomen, maak dan een issue aan op GitHub en **ga niet verder**.

source: How do I transfer day and hour statistics from a previous installation?
nl: Hoe zet ik dag- en uurstatistieken over van een vorige installatie?

source: This will only work if you have access to both the previous database and the one you're using now.
nl: Dit werkt alleen wanneer je toegang hebt tot zowel de oude als nieuwe database (die je nu gebruikt).

source: Execute on your old system/database::
nl: Voer uit op je oude systeem/database::

source: Transfer the files created above to your new system/database::
nl: Zet de bestanden, die je hierboven hebt gemaakt, over naar je nieuwe systeem/database::

source: Execute on your new system/database::
nl: Voer uit op je nieuwe systeem/database::

source: If there is any collision with dates or hours in your new database, you will see an error.
nl: Mochten er in je nieuwe database datums of uren botsen, dan krijg je daar een fout van.

source: Common error resolution
nl: Oplossingen voor veelvoorkomende fouten

source: How do I fix ``DETAIL: Key (id)=(123) already exists``?
nl: Hoe los ik ``DETAIL: Key (id)=(123) already exists`` op?

source: This depends on the situation, but you can always try the following yourself first::
nl: Het hangt af van de situatie, maar je kunt het volgende sowieso zelf eerst proberen::

source: If it does not resolve your issue, ask for support on GitHub (see end of page).
nl: Wanneer dat het probleem niet oplost, vraag dan om ondersteuning via Guthub (zie onderaan deze pagina).

source: How do I fix: ``Error: Already running on PID 1234``?
nl: Hoe los ik ``Error: Already running on PID 1234`` op?

source: If you're seeing this error::
nl: Als je deze fout ziet::

source: Just delete the PID file and restart the webinterface::
nl: Verwijder het genoemde PID-bestand en herstart de webinterface::

source: How do I fix stats after smart meter replacement?
nl: Hoe herstel ik gegevens na een meterwissel?

source: Sometimes, when relocating or due to replacement of your meter, the meter positions read by DSMR-reader will cause invalid data (e.g.: big gaps or inverted consumption). Any consecutive days should not be affected by this issue, so you will only have to adjust the data for one day.
nl: Het komt soms voor dat, door verhuizing of technische vervanging van je meter, deze meterstanden in DSMR-reader voor afwijkingen en onjuiste gegevens zorgen (bijv.: grote gaten of negatief verbruik). Dit komt alleen voor bij de dag zelf en niet bij de dagen erna. Daarom zul je de gegevens van de foutieve dag zelf moeten aanpassen.

source: The day after, you should be able to manually adjust any invalid Day or Hour Statistics :doc:`in the admin interface<configuration>` for the invalid day.
nl: De dag erna kun je dit zelf weer rechtzetten via de Dag- of Uurtotalen, :doc:`in de admin-configuratie<configuration>`, voor de betreffende dag.

source: How do I fix my smart meter reporting invalid dates?
nl: Wat moet ik doen als mijn slimme meter verkeerde datums rapporteert?

source: There are some rare cases of smart meters sending telegrams with a timestamp in the past or future. This varies from several days to even months.
nl: Er zijn zeldzame gevallen bekend waarbij slimme meters telegrammen versturen met een tijdstip ver in de toekomst of het verleden. Dit varieert van elkele dagen tot zelfs maanden.

source: First, you will need to report this to the supplier responsible for (placing) your smart meter. They might be able to fix it remotely or on site. Or even replace you meter completely (up to them to decide).
nl: Allereerst kun je dit melden bij de partij die verantwoordelijk is voor je slimme meter (doorgaans de netbeheerder). Deze kan je probleem mogelijk op afstand op lossen of moet ter plekke komen. In het ergste geval vervangen ze de meter, maar dat is helemaal aan hen om te beslissen wat te doen.

source: Until then, you can enable the "Override telegram timestamp" option in the datalogger configuration.
nl: Tot die tijd kun je het probleem omzeilen met de "Overschrijf tijdstip van telegrammen" optie in de dataloggerconfiguratie.

source: **Be advised**: Do **not** enable this option to fix any **small timestamp offset** your smart meter has (let's say, up to a few minutes). As it's only meant as a last resort for the situation described above and may cause side effects.
nl: **Let op**: Schakel deze optie **niet in** om een klein verschil in tijd te repareren (als in tot enkele minuten). Deze optie is alleen bedoeld als laatste mogelijkheid voor bovenstaande situatie en kan zorgen voor (ongewenste) bijwerkingen.

source: By default DSMR-reader reads and preserves all telegram data read.
nl: Standaard bewaart DSMR-reader alle ingelezen telegrammen.

source: When using a Raspberry Pi (or similar) combined with a DSMR version 5 smart meter (the default nowadays), you may experience issues after a while.
nl: Wanneer je een Raspberry Pi (of soortgelijk appartaat) gebruikt, samen met een DSMR versie 5 slimme meter (wordt vandaag de dag standaard geleverd), dan kun je na verloop van tijd problemen ervaren.
