Repository: dsmrreader/dsmr-reader
Catalog: docs/_locale/*/LC_MESSAGES/reference/faq.po
Languages: nl

source: This is caused by the high data throughput of DSMR version 5, which produces a new telegram every second. Both DSMR-reader and most of its users do not need this high frequency of telegrams to store, calculate and plot consumption data.
nl: Dit wordt veroorzaak door de hoge gegevensdoorvoer van DSMR versie 5, wat elke seconde voor een nieuw telegram zorgt. Zowel DSMR-reader als het meerendeel van de gebruikers hebben deze hoge frequentie echter niet nodig voor de opslag, analyze en tonen van verbruiksgegevens.

source: Therefor two measures can be taken: Increasing datalogger sleep and data retention policy.
nl: HIervoor kunnen twee maatregelen genomen worden: Verhogen van de datalogger-sleep en het instellen van een retentiebeleid.

source: How can I increase the datalogger sleep time?
nl: Hoe verhoog ik de slaaptijd van de datalogger?

source: Increase the datalogger sleep time :doc:`in the configuration<../configuration>` to 5 seconds or higher. This will save a lot of disk storage, especially when using a Raspberry Pi SD card, usually having a size of 16 GB max.
nl: Verhoog de slaaptijd van de datalogger :doc:`binnen de configuratie<../configuration>` naar minimaal 5 seconden. Dit bespaart een hoop schijfruimte, met name wanneer je een standaard Raspberry Pi SD-kaart gebruikt, die meestal maximaal 16 GB groot zijn.

source: How can I configure a data retention policy?
nl: Hoe stel ik een gegevensretentiebeleid in?

source: Configure a data retention policy :doc:`in the configuration<../configuration>`. This will eventually delete up to 99 percent of the telegrams, always preserving a few historically. Also, day and hour totals are **never** deleted by retention policies.
nl: Stel een gegevensretentiebeleid in :doc:`binnen de configuratie<../configuration>`. Dit schoont uiteindelijk tot 99 procent van de telegrammen op, waarbij een aantal altijd achterblijven i.v.m. historie. Daarnaast worden uur- en dagtotalen **nooit** opgeschoond door het retentiebeleid.

source: I'm missing gas readings?
nl: Ik mis gasverbruik?

source: Please make sure that your meter supports reading gas consumption and that you've waited for a few hours for any graphs to render. The gas meter positions are only be updated once per hour (for DSMR v4). The Status page will give you insight in this as well.
nl: Wees er allereerst zeker van dat je slimme meter uberhaupt gasverbruik registreert, en dat je een paar uur hebt gewacht. De gasmeterstanden worden sowieso slechts een keer per uur bijgewerkt (voor DSMR v4). De Status-pagina geeft je hier overigens ook inzicht in.

source: How do I only use the datalogger?
nl: Hoe gebruik ik alleen de datalogger?

source: :doc:`More information can be found here <installation>`.
nl: :doc:`Meer informatie kun je hier terugvinden<installation>`.

source: Prices
nl: Prijzen

source: How do I recalculate prices retroactively?
nl: Hoe kan ik prijzen met terugwerkende kracht herberekenen?

source: I've adjusted my energy prices but there are no changes! How can I regenerate them with my new prices?
nl: Ik heb zojuist mijn energieprijzen aangepast, maar ik zie geen verschil! Hoe kan ik de nieuwe prijzen doorvoeren?

source: Execute::
nl: Voer uit::

source: Support
nl: Ondersteuning

source: I still need help!
nl: Ik heb nog steeds hulp nodig!

source: If you can't find the answer in the documentation, do not hesitate in looking for help.
nl: Wanneer je de oplossing niet kan vinden in de documentatie, aarzel dan vooral niet om om hulp te vragen.

source: `View existing GitHub issues or create a new one <https://github.com/dsmrreader/dsmr-reader/issues>`_
nl: `Bekijk bestaande issues op GitHub of maak een nieuwe aan <https://github.com/dennissiemensma/dsmr-reader/issues>`_.
