Repository: dsmrreader/dsmr-reader
Catalog: docs/_locale/*/LC_MESSAGES/reference/plugins.po
Languages: nl

source: The application allows you to create and add plugins, hooking on certain events triggered.
nl: De applicatie staat je toe om plugins te maken en te koppelen, op bepaalde gebeurtenissen.

source: Contents
nl: Inhoudsopgave

source: Configuration
nl: Configuratie

source: You can create plugins in their own file in ``dsmr_plugins/modules/plugin_name.py``, where ``plugin_name`` is the name of your plugin.
nl: Je kan plugins maken in hun eigen bestand in ``dsmr_plugins/modules/plugin_naam.py``, waar ``plugin_naam`` de naam van je plugin is.

source: Please make sure the ``plugin_name``,
nl: Zorg er voor dat ``plugin_naam``,

source: is lowercase (``plugin_name`` and **not** ``PLUGIN_NAME``),
nl: zonder hoofdletters is (``plugin_naam`` en **niet** ``PLUGIN_NAAM``),

source: does not contains spaces or dashes, only use underscores and do not start the name with a digit.
nl: geen spaties of koppeltekens bevat, gebruik daarvoor underscores en begin de naam niet met een cijfer.

source: Add the **dotted** path as ``DSMRREADER_PLUGINS`` env var. For more information :doc:`see DSMRREADER_PLUGINS in Env Settings<./env-settings>`.
nl: Voeg het **dotted** pad in als ``DSMRREADER_PLUGINS`` env var. Voor meer informatie, :doc:`zie DSMRREADER_PLUGINS in Env-instellingen<./env-settings>`.

source: Your plugin file is imported once, so you should make sure to hook any events you want.
nl: Je plugin-bestand wordt eenmalig geimporteerd, dus zorg ervoor dat je gebeurtenissen koppelt die je wilt volgen.

source: And finally, make sure to **restart the application** to reflect the changes. Do so by executing the following as **root user or sudoer**::
nl: Tot slot, zorg ervoor dat je **de applicatie herstart** om de wijzigingen door te voeren. Voer als **root of sudo-gebruiker** dit uit::

source: Events / Signals
nl: Gebeurtenissen / Signalen

source: These are either dispatched by the Django framework or the application at some point.
nl: Deze worden verstuurd door ofwel het Django framework ofwel de applicatie zelf.

source: Called by each iteration of the backend. Please use with caution, as it may block all backend operations when used improperly.
nl: Aangeroepen bij elke iteratie van de backend. Gebruik dit terughoudend, gezien het alle backend-acties kan blokkeren wanneer het verkeerd gebruikt wordt.

source: Called by dsmr_pvoutput just before uploading data to PVOutput. The ``data`` kwarg contains the data to be sent.
nl: Aangeroepen door dsmr_pvoutput vlak voor het uploaden van gegevens naar PVOutput. De ``data`` kwarg bevat de gegevens die verstuurd worden.

source: Called by dsmr_datalogger when receiving or reading a telegram string. The ``data`` kwarg contains the raw telegram string.
nl: Aangeroepen door dsmr_datalogger wanneer er een telegram ontvangen of uitgelezen wordt. De ``data`` kwarg bevat de ruwe string met het telegram.

source: Called by dsmr_notification just after dispatching a notification. The ``title`` kwarg contains the notification title, ``message`` contains the message body.
nl: Aangeroepen door dsmr_notification vlak nadat een notificatie verstuurd wordt. De ``title`` kwarg bevat de titel van de notificatie, ``message`` bevat het inhoudelijke bericht.

source: Called by Django after saving new records to the database. Can be bound to the ``DayStatistics`` model for example, to process daily statistics elsewhere.
nl: Aangeroepen door Django bij het opslaan van nieuwe databaserecords. Kan gekoppeld worden aan bijvoorbeeld het ``DayStatistics`` model, om dagelijkse statistieken ergens anders te verwerken.

source: Other
nl: Overige

source: More signals may be available for use, please be careful when binding Django save-signals as it may impact performance.
nl: Meer signalen/gebeurtenissen zijn beschikbaar voor gebruik, echter wees voorzichtig bij het gebruiken van Django save-signalen, aangezien het de performance kan beïnvloeden.

source: Examples:
nl: Voorbeelden:

source: Example #1: Upload data to second PVOutput account
nl: Voorbeeld #1: Upload gegevens naar een tweede PVOutput-account

source: This is an example of issue `#407 <https://github.com/dsmrreader/dsmr-reader/issues/407>`_, requesting the feature to upload data to a second PVOuput account.
nl: Dit is een voorbeeld van issue `#407 <https://github.com/dsmrreader/dsmr-reader/issues/407>`_, met het verzoek om gegevens te uploaden naar een tweede PVOutput-account.

source: :doc:`DSMRREADER_PLUGINS configuration<./env-settings>`::
nl: :doc:`DSMRREADER_PLUGINS configuratie<./env-settings>`::

source: Plugin file ``dsmr_plugins/modules/secondary_pvoutput_upload.py`` (new file)::
nl: Plugin bestand ``dsmr_plugins/modules/secondary_pvoutput_upload.py`` (nieuw bestand)::

source: Note that the ``XXXXX`` and ``YYYYY`` variables should be replace by your second set of PVOutput API credentials.
nl: N.B.: De variablen ``XXXXX`` en ``YYYYY`` vervang je door de API-credentials van je tweede PVOutput-account.

source: Example #2: Forwarding raw telegram data to another serial port
nl: Voorbeeld #2: Doorsturen van ruwe telegram-gegevens naar een andere seriële poort

source: This is an example of issue `#557 <https://github.com/dsmrreader/dsmr-reader/issues/557>`_, allowing raw DSMR telegrams to be forwarded to another serial port.
nl: Dit is een voorbeeld van issue `#557 <https://github.com/dsmrreader/dsmr-reader/issues/557>`_, wat ervoor zorgt dat je DSMR-telegrammen kunt doorsturen naar een andere seriële poort.

source: Plugin file ``dsmr_plugins/modules/forward_raw_telegram_to_serial.py`` (new file)::
nl: Plugin bestand ``dsmr_plugins/modules/forward_raw_telegram_to_serial.py`` (nieuw bestand)::

source: Note that the ``/dev/ttyUSBvA`` variable should be changed to the serial port used in your own situation.
nl: N.B.: Je moet de ``/dev/ttyUSBvA`` variabele nog wijzigen naar de juiste seriële poort in je eigen situatie.

source: Example #3: Forwarding raw telegram data to another instance by API
nl: Voorbeeld #3: Doorsturen van ruwe telegram-gegevens naar een andere instantie van DSMR-reader, via de API

source: This can be quite handy if you run multiple instances of DSMR-reader (i.e.: RaspberryPI + somewhere in cloud).
nl: Dit kan behoorlijk handig zijn wanneer je meerdere instanties van DSMR-reader draait (bijvoorbeeld op een Raspberry en gespiegeld in de cloud).

source: Plugin file ``dsmr_plugins/modules/forward_raw_telegram_to_api.py`` (new file)::
nl: Plugin bestand ``dsmr_plugins/modules/forward_raw_telegram_to_api.py`` (nieuw bestand)::

source: Note that the ``API_HOST``, ``API_KEY`` and ``TIMEOUT`` variables should be changed to your own preferences.
nl: N.B.: De ``API_HOST``, ``API_KEY`` en ``TIMEOUT`` variabelen moet je nog wijzigen naar je eigen voorkeuren.

source: Example #4: Forwarding DSMR readings in JSON format to some API
nl: Voorbeeld #4: Doorsturen van DSMR-metingen in JSON-formaat naar een API

source: Use this to send DSMR readings in JSON format to some (arbitrary) API.
nl: Gebruik dit om DSMR-metingen in JSON-formaat naar een (willekeurige) API door te sturen.

source: Plugin file ``dsmr_plugins/modules/forward_json_dsmrreading_to_api.py`` (new file)::
nl: Plugin bestand ``dsmr_plugins/modules/forward_json_dsmrreading_to_api.py`` (nieuw bestand)::

source: Example #5: Read telegrams using DSMRloggerWS API
nl: Voorbeeld #5: Lees telegrammen uit de DSMRloggerWS API

source: Plugin file ``dsmr_plugins/modules/poll_dsmrloggerws_api.py`` (new file)::
nl: Plugin bestand ``dsmr_plugins/modules/poll_dsmrloggerws_api.py`` (nieuw bestand)::

source: Note that you might need to update the ``http://localhost`` value to your own situation.
nl: Let op dat je mogelijk de waarde van ``http://localhost`` moet bijwerken naar je eigen situatie.
