Repository: dsmrreader/dsmr-reader
Catalog: docs/_locale/*/LC_MESSAGES/how-to/upgrading/to-v4.po
Languages: nl

source: DSMR-reader ``v4.x`` is backwards incompatible with ``3.x``. You will have to manually upgrade to make sure it will run properly.
nl: DSMR-reader ``v4.x`` is backwards incompatible met ``3.x``. Je zult handmatig moeten upgraden om ervoor te zorgen dat het goed werkt.

source: If you're using Docker, you can probably just install the ``v4.x`` version of the Docker container without having to perform any of the steps below.
nl: Indien je Docker gebruikt, kun je vermoedelijk gewoon de ``v4.x`` versie van de Docker container gebruiken, zonder onderstaande stappen te hoeven uitvoeren.

source: Contents
nl: Inhoudsopgave

source: List of changes
nl: Lijst van wijzigingen

source: 1. Update to the latest ``v3.x`` version
nl: 1. Update naar de meeste recente ``v3.x`` versie

source: Execute the following::
nl: Voer het volgende uit::

source: 2. Install ``python3-psycopg2``
nl: 2. Installeer ``python3-psycopg2``

source: If you're using PostgreSQL, the default for DSMR-reader, install the following system package::
nl: Wanneer je PostgreSQL gebruikt, de standaard voor DSMR-reader, installeer dan de volgende systeem package::

source: If you've installed Python ``3.6`` or higher manually and the default Python version is below ``3.6``, make sure to specify it in the ``virtualenv`` command above.
nl: Als je ooit Python ``3.6`` of hoger handmatig hebt geinstalleerd, en de standaard Python-versie op het systeem is lager dan ``3.6``, zorg er dan voor dat je dit expliciet opgeeft in het ``virtualenv`` commando hierboven.

source: For example::
nl: Bijvoorbeeld::

source: If you're getting any errors, you can revert to the old version by running::
nl: Als je tegen fouten aanloopt, dan kun je terug naar de vorige versie met::

source: 3. Switch DSMR-reader to ``v4.x``
nl: 3. Wissel DSMR-reader naar ``v4.x``

source: DSMR-reader ``v4.x`` lives in a different branch, to prevent any users from unexpectedly updating to ``v4.x``.
nl: DSMR-reader ``v4.x`` leeft in een aparte branch, om te voorkomen dat gebruikers per ongeluk upgraden naar ``v4.x``.

source: 4. Migrate ``settings.py`` to ``.env``
nl: 4. Migreer ``settings.py`` naar ``.env``

source: DSMR-reader started with a ``settings.py`` for your local settings. This has some disadvantages, especially regarding today's industry standards and how Docker works as well.
nl: DSMR-reader is begonnen met een ``settings.py`` voor je lokale instellingen. Dit heeft wat nadelen, helemaal gezien de standaarden vandaag de dag en tevens in het licht hoe Docker werkt.

source: Therefor the configuration has been migrated to a ``.env`` file and system env vars are now supported as well. Follow these steps to migrate::
nl: Daarom is de configuratie voortaan via een ``.env`` bestand en is er ook standaardondersteuning voor systeem env vars. Volg deze stappen om te migreren::

source: Now check the settings you were using in ``dsmrreader/settings.py.BACKUP``. Compare them with the defaults in ``.env``.
nl: Bekijk nu je instellingen in ``dsmrreader/settings.py.BACKUP`` die je tot nu toe gebruikte. Vergelijk ze met de standaardinstellingen in ``.env``.

source: If you find any differences (e.g. different database credentials or host), update the ``.env`` file accordingly. The format should be straight forward.
nl: Als je verschillen vindt (bijvoorbeeld andere database-gegevens), werkt dan het ``.env`` bestand bij. Het formaat zou recht toe recht aan moeten zijn.

source: Please note that ``DSMRREADER_PLUGINS`` is now a comma separated list. Chances are however very slim that you were using ``DSMRREADER_PLUGINS`` at all (advanced users only).
nl: N.B.: ``DSMRREADER_PLUGINS`` is nu een komma-gescheiden lijst. De kans is overigens zeer klein dat je uberhaupt ``DSMRREADER_PLUGINS`` tot nu toe hebt gebruikt (alleen voor geavanceerde gebruikers).

source: Unsupported settings
nl: Niet-ondersteunde instellingen

source: However, you can still `use any custom Django settings <https://docs.djangoproject.com/en/3.0/ref/settings/>`_ in the ``dsmrreader/settings.py``. For example: ``X_FRAME_OPTIONS`` or ``USE_X_FORWARDED_HOST``.
nl: Desnietemin kun je nog steeds `handmatig Django-instellingen <https://docs.djangoproject.com/en/3.0/ref/settings/>`_ gebruiken in ``dsmrreader/settings.py``. Bijvoorbeeld: ``X_FRAME_OPTIONS`` of ``USE_X_FORWARDED_HOST``.

source: These are only for advanced users and should be used with care.
nl: Deze zijn alleen bedoeld voor geavanceerde gebruikers en moeten met zorg worden toegepast.

source: ``dsmrreader/settings.py`` is a Python file/module and not a key-value list of variables.
nl: ``dsmrreader/settings.py`` is een Python-bestand/module en niet een key-value lijst van variabelen.

source: You should always add them below the ``from dsmrreader.config.production import *`` line.
nl: Voeg ze altijd onder de ``from dsmrreader.config.production import *`` regel toe.

source: Finally, do not forget to reload or restart all processes after any modifications in ``.env`` or ``settings.py``.
nl: Tot slot, vergeet niet om alle processen te herladen of herstarten wanneer je wijzigingen doet in ``.env`` of ``settings.py``.

source: 5. Generate your own ``SECRET_KEY``
nl: 5. Genereer je eigen ``SECRET_KEY``

source: Previous versions had a hardcoded value for ``SECRET_KEY``. This was fine while running DSMR-reader in your home network, but it is not recommended for public facing instances.
nl: Vorige versies hadden een vaste waarde voor ``SECRET_KEY``. Dit was prima voor DSMR-reader binnen je eigen netwerk, maar niet wanneer het publiekelijk op Internet bereikbaar is.

source: To prevent some users from forgetting to set a custom secret key, DSMR-reader now simply requires everyone to generate a unique ``SECRET_KEY`` locally during installation (or when upgrading).
nl: Om te voorkomen dat sommige gebruikers in die situatie vergeten om handmatig een eigen key in te stellen, vereist DSMR-reader vanaf nu dat iedereen een eigen ``SECRET_KEY`` genereert. Ofwel tijdens de installatie ofwel tijdens het upgraden.

source: Check whether the script updated your ``.env`` file properly::
nl: Controleer of het script je ``.env`` goed heeft aangepast::

source: It should display the key generated when you execute it.
nl: Het zou de gegenereerde key moeten tonen wanneer je het uitvoert.

source: Check the configuration with::
nl: Bekijk de configuratie net::

source: If you run into the following error::
nl: Als je de volgende fout ziett::

source: Revert the ``psycopg2`` installation above with::
nl: Zet de vorige ``psycopg2`` installatie terug met::

source: 6. Drop ``dsmr_mqtt``
nl: 6. Verwijder ``dsmr_mqtt``

source: The ``dsmr_mqtt`` process has been merged with to ``dsmr_backend``.
nl: Het ``dsmr_mqtt`` proces is samengevoegd met ``dsmr_backend``.

source: Is ``dsmr_mqtt`` listed? If **not listed**, skip this chapter. Otherwise remove it::
nl: Wordt ``dsmr_mqtt`` getoond? Zo niet, sla de rest van dit hoofdstuk over. Zo ja, verwijder het::

source: Apply changes::
nl: Pas wijzigingen toe::

source: You should not see ``dsmr_mqtt`` anymore.
nl: Je zou ``dsmr_mqtt`` niet meer moeten zien.

source: Is it still listed? You might be using a legacy configuration with all processes in a single file (e.g.: ``dsmr-reader.conf``).
nl: Zie je het proces nog steeds? Dit kan gebeuren wanneer je een eerdere configuratie gebruikt waarbij alle processen in een enkel bestand staan (bijvoorbeeld: ``dsmr-reader.conf``).

source: Be sure to remove it and copy the other processes separately from the repository::
nl: Zorg ervoor dat je deze dan verwijdert en vervolgens alle andere processen apart kopieert van de repository::

source: Also, the other processes should be running as well again.
nl: Daarnaast zouden de andere processen nu weer goed moeten draaien.

source: Finally, execute the deploy script::
nl: Tot slot, voer het deploy-script uit::

source: Great. You should now be on ``v4.x``!
nl: Mooi! Je zou nu op ``v4.x`` moeten zitten!
