Repository: dsmrreader/dsmr-reader
Catalog: docs/_locale/*/LC_MESSAGES/tutorial/upgrading/to-v5.po
Languages: nl

source: Guide: Upgrading DSMR-reader v4.x to v5.x
nl: Stappenplan: DSMR-reader upgraden van v4.x naar v5.x

source: DSMR-reader ``v5.x`` is backwards incompatible with ``4.x``. You will have to manually upgrade to make sure it will run properly.
nl: DSMR-reader ``v5.x`` is backwards incompatible met ``4.x``. Je zult handmatig moeten upgraden om ervoor te zorgen dat het goed werkt.

source: Contents
nl: Inhoudsopgave

source: List of changes
nl: Lijst van wijzigingen

source: :doc:`See the changelog</reference/changelog>`, for ``v5.x releases`` and higher. Check them before updating!
nl: :doc:`Zie de changelog</reference/changelog>`, voor ``v5.x releases`` en hoger. Bekijk ze voordat je update!

source: ✋ Do not upgrade if you run **PostgreSQL 9.x or below**. *Upgrade PostgreSQL first.*
nl: ✋ Upgrade niet wanneer je **PostgreSQL 9.x of lager** draait. *Upgrade PostgreSQL eerst.*

source: ✋ Do not upgrade if you run **InfluxDB 1.x**. *Upgrade to InfluxDB 2.x first.*
nl: ✋ Upgrade niet wanneer je **InfluxDB 1.x** draait. *Upgrade naar InfluxDB 2.x eerst.*

source: ✋ Do not upgrade if you run **MySQL 5.6 or below**. *Upgrade MySQL first.*
nl: ✋ Upgrade niet wanneer je **MySQL 5.6 of lager** draait. *Upgrade MySQL eerst.*

source: ℹ️ This upgrade will require you to run (or upgrade to) **Python 3.7 or higher**. *Upgrade steps later below.*
nl: ℹ️ Deze upgrade vereist je om **Python 3.7 of hoger** te draaien. *Upgrade-stappen later hieronder.*

source: Docker users, :doc:`see the changelog</reference/changelog>` for env var changes!
nl: Docker-gebruikers, :doc:`Zie de changelog</reference/changelog>`, voor env var wijzigingen!

source: If you're using Docker, you can probably just install the ``v5.x`` version of the Docker container without having to perform any of the steps below.
nl: Indien je Docker gebruikt, kun je vermoedelijk gewoon de ``v5.x`` versie van de Docker container gebruiken, zonder onderstaande stappen te hoeven uitvoeren.

source: 1. Update to the latest ``v4.x`` version
nl: 1. Update naar de meeste recente ``v4.x`` versie

source: Update to ``v4.20`` to ensure you have the latest ``v4.x`` version.
nl: Update naar ``v4.20`` zodat je de meeste recente ``v4.x`` versie draait.

source: 2. Relocate to github.com/dsmrreader/
nl: 2. Migreer naar github.com/dsmrreader/

source: Over a year ago the DSMR-reader project was moved to ``https://github.com/dsmrreader``.
nl: Meer dan een jaar geleden is het DSMR-reader project verplaatst naar ``https://github.com/dsmrreader``.

source: Execute the following::
nl: Voer het volgende uit::

source: It should point to::
nl: Het zou moeten wijzen naar::

source: **If not**, update it and check again::
nl: **Zo niet**, update deze en probeer opnieuw::

source: 3. Python version check
nl: 3. Python versie check

source: DSMR-reader ``5.x`` requires ``Python 3.7`` or higher.
nl: DSMR-reader ``5.x`` vereist ``Python 3.7`` of hoger.

source: It should display the Python version. **If you're already running** ``Python 3.7`` **(or higher), you can ignore the next section.**
nl: Het zou de Python-versie moeten tonen. **Wanneer je al de versie** ``Python 3.7`` **(of hoger) draait, kun je de volgende sectie negeren.**

source: 4. Python version upgrade (when running ``Python 3.6`` or lower)
nl: 4. Python-versie upgrade (wanneer je ``Python 3.6`` of lager draait)

source: Only execute this section if you're running DSMR-reader with ``Python 3.6`` or lower!
nl: Voer deze sectie alleen uit wanneer je DSMR-reader draait met ``Python 3.6`` of lager!

source: There are several guides, depending on your OS. We assume Raspbian OS here.
nl: Er zijn diverse handleidingen, afhankelijk van je OS. We gaan hier uit van Raspbian OS.

source: You may consider upgrading to a higher Python version, e.g. ``Python 3.11``, if possible for your OS.
nl: Je kunt overwegen om direct naar een hogere Python-versie te upgraden, bijvoorbeeld ``Python 3.11``, indien dat mogelijk is voor het OS dat je gebruikt.

source: Try running the command ``python3 --version`` to see if things worked out. If you're getting any errors, do not continue with the upgrade.
nl: Voer ``python3 --version`` uit om te controleren of het gelukt is. Indien je foutmeldingen krijgt, ga dan niet verder met de upgrade.

source: The next thing you'll absolutely need to do, is create a fresh database backup and store it somewhere safe.
nl: Het volgende wat je absoluut moet doen, is het maken van een verse database back-up en deze op een veilige plek opslaan.

source: If things went well, you should see a message like::
nl: Wanneer alles OK is, zie je een melding in de trend van::

source: Execute the following (your file name may differ!)::
nl: Voer het volgende uit (bestandsnaam kan afwijken in jouw situatie!)::

source: Make sure the file is of some (reasonable) size::
nl: Controleer of het bestand een (aannemelijke) grootte heeft::

source: Make sure the output ends with::
nl: Controleer dat het eindigt met deze output::

source: 5. Upgrade to DSMR-reader v5
nl: 5. Upgrade naar DSMR-reader v5

source: **Reminder**
nl: **Herinnering**

source: Install Python venv::
nl: Installeer Python venv::

source: Install ``libopenjp2-7-dev`` as well, to prevent as possible error later::
nl: Installeer ook ``libopenjp2-7-dev``, om te voorkomen dat je later mogelijk deze fout krijgt::

source: Disable ``v4.x`` virtualenv::
nl: Schakel ``v4.x`` virtualenv uit::

source: Create new ``v5.x`` virtualenv::
nl: Maak nieuwe ``v5.x`` virtualenv::

source: Remove the following line from ``/home/dsmr/.bashrc``::
nl: Verwijder de volgende regel uit ``/home/dsmr/.bashrc``::

source: Remove this line (if set)::
nl: Verwijder deze regel (indien aanwezig)::

source: Add this line instead::
nl: Voeg in de plaats daarvan deze regel toe::

source: Install dependencies::
nl: Installeer dependencies::

source: Does it fail with::
nl: Faalt het met::

source: Try installing ``libjpeg-dev``::
nl: Probeer ``libjpeg-dev`` te installeren::

source: Rename any legacy setting names in ``.env`` you find (see below)::
nl: Hernoem oude env vars in ``.env`` als je die tegenkomt (zie hieronder)::

source: If you find any listed on the left hand side, rename them to the one on the right hand side::
nl: Wanneer je eentje tegenkomt die aan de linkerkant staat, hernoem die naar de variant aan de rechterkant::

source: It should output something similar to: "System check identified no issues (0 silenced)."
nl: Het zou iets moeten tonen als: "System check identified no issues (0 silenced)."

source: Make sure you've installed ``libopenjp2-7-dev`` above::
nl: Zorg dan dat je hierboven ``libopenjp2-7-dev`` hebt geïnstalleerd::

source: Execute::
nl: Voer uit::

source: Note: This *may* revert any customizations you've done yourself, such as HTTP Basic Auth configuration.
nl: N.b.: Dit *kan* alle handmatige wijzigingen die je zelf ooit hebt gedaan terugdraaien, zoals HTTP Basic Auth configuratie.

source: Reload Nginx::
nl: Herlaad Nginx::

source: Reload Supervisor configs::
nl: Herlaad Supervisor configs::

source: Finally, execute the deploy script::
nl: Tot slot, voer het deploy-script uit::

source: Great. You should now be on ``v5.x``!
nl: Top! Je zou nu ``v5.x`` moeten draaien!

source: 7. Situational: Reconfigure InfluxDB
nl: 7. Situationeel: Herconfigureer InfluxDB

source: If you happened to use DSMR-reader export to InfluxDB previously, you **must** reconfigure it accordingly in order to get it working again. It has been disabled automatically as well.
nl: Als je DSMR-reader gebruikte om data te exporteren naar InfluxDB, dan **moet** je deze integratie handmatig opnieuw configureren om het werkend te krijgen. De integratie is tevens automatisch uitgeschakeld.

source: Where the previous version utilized *usernames*, *passwords* and *databases*, it now connects using *organizations*, *API tokens* and *buckets*.
nl: Waar de vorige versie *usernames*, *passwords* en *databases* gebruikte, is het nu gewijzigd naar *organizations*, *API tokens* en *buckets*.

source: 8. Situational: Reconfigure Dropbox
nl: 8. Situationeel: Herconfigureer Dropbox

source: If you happened to use DSMR-reader's Dropbox sync for backups, you **must** reconfigure it accordingly in order to get it working again.
nl: Als je DSMR-reader gebruikte om backups naar Dropbox te sturen, dan **moet** je deze integratie handmatig opnieuw configureren om het werkend te krijgen.

source: 9. Situational: Remote datalogger env vars
nl: 9. Situationeel: Remote datalogger env vars

source: The following **remote datalogger script** settings were renamed as well, but you'll only need to change them if you use and update the remote datalogger script as well. E.g. when running it in Docker::
nl: De volgende **remote datalogger script** instellingen zijn ook hernoemd, maar je hoeft ze alleen aan te passen als je ze daadwerkelijk gebruikt, samen met een nieuwe versie van het remote datalogger script. Bijvoorbeeld wanneer je Docker gebruikt::
