Repository: dsmrreader/dsmr-reader
Catalog: docs/_locale/*/LC_MESSAGES/tutorial/upgrading/to-v3.po
Languages: nl

source: Guide: Upgrading DSMR-reader v2.x to v3.x
nl: Stappenplan: DSMR-reader v2.x upgraden naar v3.x

source: DSMR-reader ``v3.x`` is backwards incompatible with ``2.x``. You will have to manually upgrade to make sure it will run properly.
nl: DSMR-reader ``v3.x`` is niet backwards-compatible met ``v2.x``. Je zult hierdoor dus handmatig moeten upgraden om er zeker van te zijn dat alles blijft werken.

source: If you're using Docker, you can probably just install the ``v3.x`` version of the Docker container without any of the steps below.
nl: Mocht je Docker gebruiken, dan kun je waarschijnlijk gewoon de ``v3.x`` versie van de betreffende Docker-container installeren, zonder onderstaande stappen te hoeven uitvoeren.

source: Contents
nl: Inhoudsopgave

source: 1. Update to the latest ``v2.x`` version (``v2.15``)
nl: 1. Update naar de laatste ``v2.x`` versie (``v2.15``)

source: Execute the following::
nl: Voer het volgende uit::

source: 2. Python version check
nl: 2. Python versie check

source: DSMR-reader ``3.x`` requires ``Python 3.6`` or higher.
nl: DSMR-reader ``3.x`` vereist ``Python 3.6`` of hoger.

source: It should display the Python version. If you're already running ``Python 3.6`` (or higher), you can ignore the next section.
nl: Het zou de Python-versie moeten tonen. Wanneer je al de versie ``Python 3.6`` (of hoger) draait, kun je de volgende sectie negeren.

source: 3. Python version upgrade (part 1/2)
nl: 3. Python versie upgrade (deel 1/2)

source: Only execute this section if you're running DSMR-reader with ``Python 3.5`` or lower!
nl: Voer deze sectie alleen uit wanneer je DSMR-reader draait met ``Python 3.5`` of lager!

source: There are several guides, depending on your OS. We assume Raspbian OS here.
nl: Er zijn diverse handleidingen, afhankelijk van je OS. We gaan hier uit van Raspbian OS.

source: Try running the command ``python3.6 --version`` to see if things worked out. If you're getting any errors, do not continue with the upgrade.
nl: Probeer om ``python3.6 --version`` uit te voeren om te controleren of het gelukt is. Wanneer je foutmeldingen krijgt, ga dan niet verder met de upgrade.

source: The Python upgrade continues later, after creating a backup.
nl: De Python-upgrade gaat later verder, na het maken van een back-up.

source: The next thing you'll absolutely need to do, is create a fresh database backup and store it somewhere safe.
nl: Het volgende wat je absoluut moet doen, is het maken van een verse database back-up en deze op een veilige plek opslaan.

source: If things went well, you should see a message like::
nl: Wanneer alles OK is, zie je een melding in de trend van::

source: Execute the following (your file name may differ!)::
nl: Voer het volgende uit (bestandsnaam kan afwijken in jouw situatie!)::

source: Make sure the file is of some (reasonable) size::
nl: Controleer of het bestand een (aannemelijke) grootte heeft::

source: Make sure the output ends with::
nl: Controleer dat het eindigt met deze output::

source: 5. Python version upgrade (part 2/2)
nl: 5. Python versie upgrade (deel 2/2)

source: Now we're ready to remove the environment DSMR-reader uses.
nl: Nu zijn we klaar om de omgeving te verwijderen waarin DSMR-reader werkt.

source: If you're getting any errors, you can revert to the old version by running::
nl: Mocht je fouten krijgen, hiermee kun je weer terug naar de oude versie::

source: Everything okay? Time to upgrade DSMR-reader to v3.x.
nl: Alles OK? Tijd om DSMR-reader te upgraden naar v3.x.

source: 6. Switching DSMR-reader to ``v3.x``
nl: 6. Wisselen naar DSMR-reader ``v3.x``

source: DSMR-reader ``v3.x`` lives in a different branch, to prevent any users from unexpectedly updating to ``v3.x``.
nl: DSMR-reader ``v3.x`` leeft in een andere branch, om te voorkomen dat gebruikers onbedoeld upgraden naar ``v3.x``.

source: Great. You should now be on ``v3.x``!
nl: Mooi! Je zou nu op ``v3.x`` moeten zitten!
