Repository: dsmrreader/dsmr-reader
Catalog: docs/locale/*/LC_MESSAGES/installation.po
Languages: nl

source: Installation
nl: Installatie

source: Choose either option A, B, C or D below.
nl: Kies hieronder voor optie A, B, C of D.

source: Contents
nl: Inhoudsopgave

source: Option A: Install DSMR-reader manually (quick)
nl: Optie A: Installeer DSMR-reader handmatig (snel)

source: Use this to host both the datalogger and application on the same machine by installing it manually.
nl: Gebruik dit om zowel de datalogger als de applicatie op hetzelfde apparaat te installeren.

source: Contains just a list of commands needed for the installation of DSMR-reader.
nl: Bevat alleen een lijst met commando's nodig voor de installatie van DSMR-reader.

source: Part 1
nl: Deel 1

source: Execute::
nl: Voer uit::

source: Does PostgreSQL not start/create the cluster due to locales? E.g.::
nl: Start PostgreSQL niet wegens een fout in 'locales'? Bijvoorbeeld::

source: Try: ``dpkg-reconfigure locales``.
nl: Probeer: ``dpkg-reconfigure locales``.

source: Still no luck? Try editing ``/etc/environment``, add ``LC_ALL="en_US.utf-8"`` and reboot. Then try ``pg_createcluster 9.4 main --start`` again (or whatever version you are using).
nl: Werkt het nog steeds niet? Open dan dit bestand ``/etc/environment``, voeg onderaan de regel ``LC_ALL="en_US.utf-8"`` toe en herstart het systeem. Probeer daarna ``pg_createcluster 9.4 main --start`` (of welke versie je ook gebruikt).

source: Continue::
nl: Ga verder::

source: Optional: Restore a database backup
nl: Optioneel: Database back-up terugzetten

source: If you need to restore a database backup with your existing data, this is the moment to do so.
nl: Indien je een back-up van de database wilt terugzetten met je oude gegevens, nu is het moment om dat te doen.

source: Restoring a database backup? :doc:`See the FAQ for instructions <faq>`.
nl: Database back-up terugzetten? :doc:`Zie de FAQ voor instructies <faq>`.

source: Part 2
nl: Deel 2

source: :doc:`Finished? Go to setting up the application<../application>`.
nl: :doc:`Klaar? Ga dan naar applicatie instellen<../application>`.

source: Option B: Install DSMR-reader manually (explained)
nl: Optie B: Installeer DSMR-reader handmatig (toegelicht)

source: For others users who want some addition explanation about what they are exactly doing/installing.
nl: Voor alle andere gebruikers, die graag willen weten wat ze exact uitvoeren.

source: 1. Database backend (PostgreSQL)
nl: 1. Databaseopslag (PostgreSQL)

source: The application stores by default all readings taken from the serial cable.
nl: De applicatie slaat de P1-metingen standaard op.

source: Install database::
nl: Installeer database::

source: (!) Ignore any '*could not change directory to "/root": Permission denied*' errors for the following three commands.
nl: (!) Negeer voor de volgende drie commando's de foutmelding: '*could not change directory to "/root": Permission denied*'.

source: Create database user::
nl: Creëer databasegebruiker::

source: Create database, owned by the database user we just created::
nl: Creëer database, met als eigenaar de databasegebruiker die we net hebben aangemaakt::

source: Set password for database user::
nl: Stel wachtwoord in voor databasegebruiker::

source: 2. Dependencies
nl: 2. Afhankelijkheden

source: Now you'll have to install several utilities, required for the Nginx webserver, Gunicorn application server and cloning the application code from the Github repository::
nl: Tijd om diverse tools te installeren. Deze zijn nodig voor de Nginx webserver, de Gunicorn applicatieserver en voor het binnenhalen van de code van de applicatie vanaf Github::

source: Install ``cu``. The CU program allows easy testing for your DSMR serial connection. It's very basic but also very effective to simply test whether your serial cable setup works properly::
nl: Installeer ``cu``. Met dit programmaatje kunnen kun je vrij gemakkelijk de DSMR-verbinding testen naar je slimme meter toe. Erg handig om te kijken of dat überhaupt al lekker werkt::

source: 3. Application user
nl: 3. Applicatiegebruiker

source: The application runs as ``dsmr`` user by default. This way we do not have to run the application as ``root``, which is a bad practice anyway.
nl: De applicatie draait standaard onder de gebruiker ``dsmr``. Hierdoor heeft het geen ``root``-rechten (nodig), wat over het algemeen zeer afgeraden wordt.

source: Create user with homedir. The application code and virtualenv will reside in this directory as well::
nl: Maak een aparte gebruiker aan met eigen homedir. De code voor de applicatie en VirtualEnv zetten we later hier in::

source: Our user also requires dialout permissions. So allow the user to perform a dialout by adding it to the ``dialout`` group::
nl: De gebruiker heeft ook toegang nodig om de kabel te kunnen uitlezen. Hiervoor voegen de we gebruiker toe aan de groep ``dialout``::

source: Either proceed to the next heading **for a test reading** or continue at chapter 4.
nl: Ga ofwel door naar het volgende hoofdstuk **voor een testmeting** of ga direct door naar stap 4.

source: Optional: Your first reading
nl: Optioneel: Je eerste meting

source: **OPTIONAL**: You may skip this section as it's not required for the application to install. However, if you have never read your meter's P1 telegram port before, I recommend to perform an initial reading to make sure everything works as expected.
nl: **OPTIONEEL**: Je kunt deze stap overslaan wanneer je al eerder een (test)meting hebt gedaan met je slimme meter. Ik raad het dus vooral aan als je nog nooit eerder je P1-poort hebt uitgelezen. Hiermee verzeker je jezelf ook dat de applicatie straks dezelfde (werkende) toegang heeft voor de metingen.

source: Now login as the user we have just created, to perform our very first reading! ::
nl: Log nu in als de gebruiker die we zojuist hebben aangemaakt voor de eerste testmeting! ::

source: Test with ``cu`` for **DSMR 4+**::
nl: Test met ``cu`` voor **DSMR 4+**::

source: Or test with ``cu`` for **DSMR 2.2** (untested)::
nl: Of test met ``cu`` voor **DSMR 2.2** (ongetest)::

source: You now should see something similar to ``Connected.`` and a wall of text and numbers *within 10 seconds*. Nothing? Try different BAUD rate, as mentioned above. You might also check out a useful blog, `such as this one (Dutch) <http://gejanssen.com/howto/Slimme-meter-uitlezen/>`_.
nl: Je zou nu iets moeten zien als ``Connected.``. Vervolgens krijg je, als het goed is, binnen tien seconden een hele lap tekst te zijn met een hoop cijfers. Werkt het niet? Probeer dan een andere BAUD-waarde, zoals hierboven beschreven. Of `kijk op een nuttig weblog <http://gejanssen.com/howto/Slimme-meter-uitlezen/>`_.

source: To exit cu, type "``q.``", hit Enter and wait for a few seconds. It should exit with the message ``Disconnected.``.
nl: Om cu af te sluiten, typ "``q.``", druk op Enter en wacht voor een paar seconden. Het programma sluit af met de melding ``Disconnected.``.

source: 4. Webserver/Nginx (part 1)
nl: 4. Webserver/Nginx (deel 1)

source: *We will now prepare the webserver, Nginx. It will serve all application's static files directly and proxy any application requests to the backend, Gunicorn controlled by Supervisor, which we will configure later on.*
nl: *We configureren vervolgens de webserver (Nginx). Deze serveert alle statische bestanden en geeft de applicatie-verzoeken door naar de backend, waar de applicatie in Gunicorn draait onder Supervisor. Deze stellen we later in.*

source: Make sure you are acting here as ``root`` or ``sudo`` user. If not, press CTRL + D to log out of the ``dsmr`` user.
nl: Zorg ervoor dat je hier ``root``- of ``sudo``-gebruiker bent. Zo niet, druk op CTRL + D om uit te loggen als ``dsmr`` gebruiker.

source: Django will later copy all static files to the directory below, used by Nginx to serve statics. Therefor it requires (write) access to it::
nl: Django kopieert alle statische bestanden naar een aparte map, die weer door Nginx gebruikt wordt. Daarom is er tevens (schrijf)toegang voor nodig::

source: 5. Clone project code from Github
nl: 5. Kloon project code vanaf Github

source: Now is the time to clone the code from the repository into the homedir we created.
nl: Nu kunnen we de code van de applicatie van Github downloaden en in de homedir zetten die we net aangemaakt hebben.

source: Make sure you are now acting as ``dsmr`` user (if not then enter: ``sudo su - dsmr``)
nl: Zorg ervoor dat je ingelogd bent als ``dsmr``-gebruiker (zo niet, typ dan: ``sudo su - dsmr``)

source: Clone the repository::
nl: Kloon de repository::

source: This may take a few seconds. When finished, you should see a new folder called ``dsmr-reader``, containing a clone of the Github repository.
nl: Dit kan enkele seconden in beslag nemen. Als het goed is zie je hierna een map genaamd ``dsmr-reader``, met daarin een kopie van de repository zoals die op Github staat.

source: The dependencies our application uses are stored in a separate environment, also called **VirtualEnv**.
nl: Alle (externe) afhankelijkheden worden opgeslagen in een aparte omgeving, ook wel **VirtualEnv** genoemd.

source: Although it's just a folder inside our user's homedir, it's very effective as it allows us to keep dependencies isolated or to run different versions of the same package on the same machine. `More information about this subject can be found here <http://docs.python-guide.org/en/latest/dev/virtualenvs/>`_.
nl: Dit is allemaal erg handig, ondanks dat het feitelijk niets meer voorstelt dan een aparte map binnen de homedir van onze gebruiker. Hierdoor kunnen we namelijk meerdere versie van software op hetzelfde systeem installeren, zonder dat dat elkaar bijt. Meer informatie hierover `kan hier gevonden worden <http://docs.python-guide.org/en/latest/dev/virtualenvs/>`_.

source: Make sure you are still acting as ``dsmr`` user (if not then enter: ``sudo su - dsmr``)
nl: Zorg ervoor dat je nog steeds ingelogd bent als ``dsmr``-gebruiker (zo niet, typ dan: ``sudo su - dsmr``)

source: Create folder for the virtualenv(s) of this user::
nl: Maak map aan voor de VirtualEnv van deze gebruiker::

source: Create a new virtualenv, we usually use the same name for it as the application or project::
nl: Maak een nieuwe VirtualEnv aan. Het is gebruikelijk om hiervoor dezelfde naam te gebruiken als die van de applicatie of het project::

source: Note that it's important to specify **Python 3** as the default interpreter.
nl: N.B.: het is belangrijk dat je voor deze VirtualEnv aangeeft dat **Python 3** de gewenste standaardversie is.

source: Each time you work as ``dsmr`` user, you will have to switch to the virtualenv with these commands::
nl: Elke keer dat je als ``dsmr`` gebruiker werkt, zul je moeten wisselen naar de virtualenv met deze commando's::

source: Let's have both commands executed **automatically** every time we login as ``dsmr`` user, by adding them ``~/.bashrc`` file::
nl: Laten we ervoor zorgen dat deze commando's **automatisch** uitgevoerd worden, zodra we inloggen als ``dsmr`` gebruiker. Dit doen we door ze toe te voegen aan het ``~/.bashrc`` bestand::

source: This will both activate the virtual environment and cd you into the right directory on your **next login** as ``dsmr`` user.
nl: Hiermee wordt zowel de VirtualEnv geactiveerd en ga je direct naar de juiste map. Dit werkt de **eerstvolgende keer** dat je inlogt als ``dsmr`` gebruiker.

source: You can easily test whether you've configured this correctly by logging out the ``dsmr`` user (CTRL + D) and login again using ``sudo su - dsmr``.
nl: Je kunt dit vrij gemakkelijk testen door uit te loggen als ``dsmr`` gebruiker (met CTRL + D) en vervolgens weer in te loggen met ``sudo su - dsmr``.

source: You should see the terminal have a ``(dsmrreader)`` prefix now, for example: ``(dsmrreader)dsmr@rasp:~/dsmr-reader $``
nl: Als het goed is heeft je terminal nu een ``(dsmrreader)`` prefix, bijvoorbeeld: ``(dsmrreader)dsmr@rasp:~/dsmr-reader $``

source: Make sure you've read and executed the note above, because you'll need it for the next chapter.
nl: Zorg ervoor dat je de bovenstaande notitie hebt gelezen en uitgevoerd, aangezien ze nodig zijn voor het volgende hoofdstuk.

source: 7. Application configuration & setup
nl: 7. Applicatieconfiguratie

source: The application will also need the appropriate database client, which is not installed by default. For this I created two ready-to-use requirements files, which will also install all other dependencies required, such as the Django framework.
nl: De applicatie heeft een databaseconnector nodig om de gegevens te kunnen opslaan. Daarvoor heb ik een tweetal requirements-bestanden gemaakt, waar alles al in staat wat nodig is. Zoals bijvoorbeeld Django en de databaseverbinding.

source: Setup local config::
nl: Stel lokale config in::

source: **Installation of the requirements below might take a while**, depending on your Internet connection, RaspberryPi speed and resources (generally CPU) available. Nothing to worry about. :]
nl: **De installatie van de volgende afhankelijkheden kan enige tijd in beslag nemen**. Dit varieert en is sterk afhankelijk van de snelheid van je Internet-verbinding en je RaspberryPi. Je hoeft je dus niet zorgen te maken wanneer dit lang lijkt te duren. :]

source: Install dependencies::
nl: Installeer afhankelijkheden::

source: 8. Bootstrapping
nl: 8. Initialisatie

source: Now it's time to bootstrap the application and check whether all settings are good and requirements are met.
nl: Tijd om te kijken of alles goed is ingesteld. We gaan de applicatie proberen te initialiseren.

source: Execute this to initialize the database we've created earlier::
nl: Voer dit uit om de database te initialiseren::

source: Prepare static files for webinterface. This will copy all static files to the directory we created for Nginx earlier in the process. It allows us to have Nginx serve static files outside our project/code root.
nl: Ga nu bezig met de statische bestanden voor de webinterface. Dit kopieert alle statische bestanden in de map die we eerder, vlak na de installatie voor Nginx, hebben aangemaakt. Het zorgt ervoor dat Nginx deze bestanden kan hosten buiten de code-bestanden.

source: Sync static files::
nl: Synchroniseer statische bestanden::

source: Create an application superuser with the following command. The ``DSMRREADER_ADMIN_USER`` and ``DSMRREADER_ADMIN_PASSWORD`` :doc:`as defined in Env Settings<../env_settings>` will be used for the credentials.
nl: Maak een applicatie superuser aan met het volgende commando. De ``DSMRREADER_ADMIN_USER`` en ``DSMRREADER_ADMIN_PASSWORD`` :doc:`zoals ze in de Env-instellingen<../env_settings>` staan, worden daarbij gebruikt als inloggegevens.

source: You've almost completed the installation now.
nl: Je bent op dit punt bijna klaar met de installatie.

source: 9. Webserver/Nginx (part 2)
nl: 9. Webserver/Nginx (deel 2)

source: This installation guide asumes you run the Nginx webserver for this application only.
nl: Deze installatiehandleiding gaat er vanuit dat je de Nginx webserver alleen gebruikt voor deze applicatie.

source: It's possible to have other applications use Nginx as well, but that requires you to remove the wildcard in the ``dsmr-webinterface`` vhost, which you will copy below.
nl: Het is uiteraard mogelijk dat andere applicaties ook Nginx gebruiken, maar daarvoor zul je de wildcard moet weghalen in de ``dsmr-webinterface`` vhost, die je hieronder kopieert.

source: Remove the default Nginx vhost (**only when you do not use it yourself, see the note above**)::
nl: Verwijder de standaard vhost van Nginx **wanneer je deze niet zelf gebruikt** (zie de notitie hierboven)::

source: Copy application vhost, **it will listen to any hostname** (wildcard), but you may change that if you feel like you need to. It won't affect the application anyway::
nl: Kopieer de vhost voor de applicatie. Deze luistert standaard naar **elke hostname** (wildcard), maar dat is natuurlijk naar eigen wens aan te passen::

source: Let Nginx verify vhost syntax and restart Nginx when the ``-t`` configtest passes::
nl: Laat Nginx controleren of je geen typefouten hebt gemaakt en herstart Nginx vervolgens wanneer de ``-t`` configtest lukt::

source: Now we configure `Supervisor <http://supervisord.org/>`_, which is used to run our application's web interface and background jobs used. It's also configured to bring the entire application up again after a shutdown or reboot.
nl: We gaan nu `Supervisor <http://supervisord.org/>`_ configureren, die gebruikt wordt om de applicatie en achtergrondprocessen te draaien. Tevens zorgt Supervisor ervoor dat deze processen bij het (opnieuw) opstarten automatisch draaien.

source: Copy the configuration files for Supervisor::
nl: Kopieer de configuratie-bestanden voor Supervisor::

source: Login to ``supervisorctl`` management console::
nl: Wissel naar de ``supervisorctl`` beheerconsole::

source: Enter these commands (**listed after the** ``>``). It will ask Supervisor to recheck its config directory and use/reload the files::
nl: Voer de volgende commando's in (**degene na de** ``>``). Dit zorgt ervoor dat Supervisor zijn eigen configuratie opnieuw controleert en toepast::

source: Three processes should be started or running. Make sure they don't end up in ``ERROR`` or ``BACKOFF`` state, so refresh with the ``status`` command a few times.
nl: Er draaien als het goed is altijd **drie** processen. Kijk goed of ze uiteindelijk niet in ``ERROR`` of ``BACKOFF`` status terecht zijn gekomen. Je kunt het overzicht verversen door ``status`` te typen.

source: When still in ``supervisorctl``'s console, type::
nl: Typ het volgende wanneer je nog in ``supervisorctl``'s console bent::

source: Example of everything running well::
nl: Voorbeeld van wanneer alles naar behoren draait::

source: Want to quit supervisor? Press ``CTRL + D`` to exit supervisor command line.
nl: Wil je uit supervisor? Druk dan op ``CTRL + D`` om uit supervisor te gaan.

source: Option C: Install DSMR-reader using Docker
nl: Optie C: Installeer DSMR-reader met Docker

source: Author
nl: Auteur

source: Option D: Install datalogger only
nl: Optie D: Installeer alleen de datalogger

source: This will install a datalogger that will forward telegrams to a remote instance of DSMR-reader, using its API.
nl: Dit installeert een datalogger, die telegrammen doorstuurt naar een installatie van DSMR-reader op afstand, via de API.

source: The remote datalogger script has been overhauled in DSMR-reader ``v4.1``. If you installed a former version, reconsider reinstalling it completely with the new version below.
nl: Het script voor de remote datalogger is op de schop gegaan in DSMR-reader ``v4.1``. Mocht je een eerdere versie gebruiken, overweeg dan om deze opnieuw te installeren met de nieuwere versie hieronder.

source: To be clear, there should be two hosts:
nl: Voor de duidelijkheid, er zouden twee omgevingen moeten zijn:

source: The device hosting the remote datalogger
nl: Het apparaat waar de remote datalogger op draait

source: The device (or server) hosting the receiving DSMR-reader instance
nl: Het apparaat (of server) waarop de ontvangende DSMR-reader-instantie draait

source: Receiving DSMR-reader instance
nl: Ontvangende DSMR-reader-instantie

source: Make sure to first prepare the API at the DSMR-reader instance you'll forward the telegrams to. You can enable the API and view/edit the API key used :doc:`in the configuration<../configuration>`.
nl: Zorg ervoor dat je eerste de API van de ontvangende DSMR-reader-instantie klaar hebt staan. Je kunt daar de API inschakelen en bijbehorende API-sleutel inzien/bewerken :doc:`in de configuratie<../configuration>`.

source: If your smart meter only supports DSMR v2 (or you are using a non Dutch smart meter), make sure to change the DSMR version :doc:`in the configuration<../configuration>` as well, to have DSMR-reader parse them correctly.
nl: Wanneer je slimme meter alleen DSMR v2 ondersteunt (of je gebruikt een niet-Nederlandse slimme meter), zorg er dan voor dat je de DSMR-versie aanpast :doc:`in de datalogger-configuratie <../configuration>`, zodat DSMR-reader de telegrammen goed kan verwerken.

source: Also, you should disable the datalogger process over there, since you won't be using it anyway::
nl: Verder kun je hier het datalogger proces uitschakelen, gezien die toch niet nodig is::

source: Remote datalogger device
nl: Apparaat met remote datalogger

source: Switch to the device you want to install the remote datalogger on.
nl: Wissel naar het apparaat waarop je de remote datalogger wilt installeren.

source: Create a new file ``/home/dsmr/dsmr_datalogger_api_client.py`` with the following contents: `dsmr_datalogger_api_client.py on GitHub <https://github.com/dsmrreader/dsmr-reader/blob/v4/dsmr_datalogger/scripts/dsmr_datalogger_api_client.py>`_
nl: Maak een nieuw bestand ``/home/dsmr/dsmr_datalogger_api_client.py`` met deze inhoud: `dsmr_datalogger_api_client.py op GitHub <https://github.com/dsmrreader/dsmr-reader/blob/v4/dsmr_datalogger/scripts/dsmr_datalogger_api_client.py>`_

source: Or execute the following to download it directly to the path above::
nl: Of voer het volgende uit om het direct op bovenstaand pad te downloaden::

source: API config (``.env``)
nl: API-configuratie (``.env``)

source: The ``.env`` file below is not mandatory to use. Alternatively you can specify all settings mentioned below as system environment variables.
nl: Je bent niet verplicht om het ``.env``-bestand te gebruiken. Als alternatief kun je alle instellingen hieronder ook als systeem-omgevingsvariabelen instellen.

source: Create another file ``/home/dsmr/.env`` and add as contents::
nl: Maak een ander bestand genaamd ``/home/dsmr/.env`` aan en zet daar de volgende inhoud in::

source: Keep the file open for multiple edits / additions below.
nl: Houd het bestand open voor meerdere wijziginge / toevoegingen hieronder.

source: Add the schema (``http://``/``https://``) and hostname/port to ``DATALOGGER_API_HOSTS``. Add the API key to ``DATALOGGER_API_KEYS``. For example::
nl: Voeg het schema (``http://``/``https://``) en hostnaam/poort toe aan ``DATALOGGER_API_HOSTS``. Voeg de API key toe aan ``DATALOGGER_API_KEYS``. Bijvoorbeeld::

source: Are you using the remote datalogger for multiple instances of DSMR-reader? Then use ``DATALOGGER_API_HOSTS`` and ``DATALOGGER_API_KEYS`` as comma separated lists::
nl: Gebruik je dezelfde remote datalogger voor meerdere instanties van DSMR-reader? Gebruik dan ``DATALOGGER_API_HOSTS`` en ``DATALOGGER_API_KEYS`` als komma-gescheiden lijsten::

source: Serial port or network socket config?
nl: Seriële poort of netwerk socket instellen?

source: Choose either ``A.`` or ``B.`` below.
nl: Kies hieronder voor ofwel ``A.`` of ``B.``.

source: A. Serial port (``.env``)
nl: A. Seriële poort (``.env``)

source: Are you using a cable to read telegrams directly from a serial port?
nl: Gebruik je een kabel om telegrammen direct vanaf de seriële poort uit te lezen?

source: Then add the following contents to ``/home/dsmr/.env``::
nl: Voeg dan de volgende inhoud toe aan ``/home/dsmr/.env``::

source: When needing a different port or serial settings, change the values accordingly. E.g.: For an older smart meter::
nl: Mocht je een andere poort of seriële instelling nodig hebben, verander dan de waarden naar wens. Bijvoorbeeld voor een oudere slimme meter::

source: B. Network socket (``.env``)
nl: B. Netwerk socket (``.env``)

source: Are you using a network socket for reading the telegrams? E.g.: ``ser2net``.
nl: Gebruik je een netwerk socket voor het uitlezen van de telegrammen? Bijvoorbeeld: ``ser2net``.
