Repository: dsmrreader/dsmr-reader
Catalog: docs/locale/*/LC_MESSAGES/installation.po
Languages: nl

source: Set the hostname or IP address in ``DATALOGGER_NETWORK_HOST`` and the port in ``DATALOGGER_NETWORK_PORT``.
nl: Stel de hostnaam of IP-adres in als ``DATALOGGER_NETWORK_HOST``en de poort als ``DATALOGGER_NETWORK_PORT``.

source: Other settings (``.env``)
nl: Overige instellingen (``.env``)

source: These settings are **optional** but can be tweaked when required:
nl: De volgende instellingen zijn **optioneel** en kunnen naar wens aangepast worden, wanneer nodig:

source: ``DATALOGGER_TIMEOUT``: The timeout in seconds that applies to reading the serial port and/or writing to the DSMR-reader API. Omit to use the default value.
nl: ``DATALOGGER_TIMEOUT``: De tijd in seconden dat maximaal gewacht wordt op de datalogger en de ontvangende DSMR-reader API. Laat weg om de standaardwaarde te gebruiken.

source: ``DATALOGGER_SLEEP``: The time in seconds that the datalogger will pause after each telegram written to the DSMR-reader API. Omit to use the default value.
nl: ``DATALOGGER_SLEEP``: De tijd in seconden dat de remote datalogger pauseert, nadat deze een telegram naar de DSMR-reader API heeft verstuurt. Laat weg om de standaardwaarde te gebruiken.

source: ``DATALOGGER_DEBUG_LOGGING``: Set to ``true`` or ``1`` to enable verbose debug logging. Omit to disable. Warning: Enabling this logging for a long period of time on a Raspberry Pi may cause accelerated wearing of your SD card!
nl: ``DATALOGGER_DEBUG_LOGGING``: Stel in op ``true`` of ``1`` om uitgebreide debug-logging in te schakelen. Laat weg om uit te schakelen. Waarschuwing: Indien voor langere tijd ingeschakeld kan dit bijdragen aan de slijtage van je SD-kaartje op een Raspberry Pi!

source: The following steps are also meant for the device you've just installed the remote datalogger on.
nl: De stappen hieronder zijn eveneens bedoeld voor het apparaat waar je net de remote datalogger op geinstalleerd hebt.

source: Create a new supervisor config in ``/etc/supervisor/conf.d/dsmr_remote_datalogger.conf`` with contents::
nl: Maak een nieuwe Supervisor-config in ``/etc/supervisor/conf.d/dsmr_remote_datalogger.conf`` met inhoud::

source: Have Supervisor reread and update its configs to initialize the process::
nl: Laat Supervisor zijn eigen instellingen uitlezen en doorvoeren, om het proces te starten::

source: The script should now forward telegrams to the API host(s) you specified.
nl: Het script zou nu telegrammen moeten doorsturen naar de API host(s) die je eerder hebt ingevoerd.
