Repository: dsmrreader/dsmr-reader
Catalog: docs/locale/*/LC_MESSAGES/mqtt.po
Languages: nl

source: The application supports sending MQTT messages to your broker.
nl: De applicatie ondersteunt het versturen van MQTT-berichten naar je eigen broker toe.

source: The following events can trigger MQTT messages when enabled:
nl: De volgende events kunnen MQTT-berichten versturen wanneer ingeschakeld:

source: Raw telegrams
nl: Onbewerkte telegrammen

source: Each time a telegram is read via the v1 API or datalogger. You can have the entire telegram string passed on to your MQTT broker.
nl: Elke keer dat een telegram is is uitgelezen via de v1 API of datalogger. Je kunt het gehele telegram 1-op-1 doorsturen naar je MQTT-broker.

source: Reading creation
nl: Meting aangemaakt

source: Each time a new reading is parsed, either created by the datalogger or v1/v2 API. You can have each parsed reading passed on to your broker either in JSON format or on a per-field per-topic basis.
nl: Elke keer dat er een nieuwe meting is opgeslagen, ofwel via de datalogger ofwel via de v1/v2 API. Je kunt elke nieuwe meting doorsturen naar je broker in ofwel JSON-formaat, ofwel los per veld per topic.

source: Configuration
nl: Configuratie

source: Support for MQTT is disabled by default in the application. You may enable it in your configuration or admin settings.
nl: Ondersteuning voor MQTT is standard uitgeschakeld. Je kunt dit inschakelen in de configuratie/admin-instellingen.

source: Broker configuration
nl: Brokerconfiguratie

source: The broker configuration allows you to set the hostname and port of your broker. Optionally, you can enter any credentials here as well.
nl: De brokerconfiguratie stelt je in staat om de hostnaam en poort van je broker in te stellen. Optioneel kun je hier ook benodigde inloggegevens invoeren.

source: Raw telegram configuration
nl: Onbewerkte telegram configuratie

source: This allows you to send each raw telegram received to your broker. Just enable it and enter the topic path it should be sent to.
nl: Dit zorgt ervoor dat elk onbewerkt telegram 1-op-1 wordt doorgestuurd naar je broker. Je hoeft dit alleen in te schakelen en het topic in te voeren waar het naartoe gestuurd mag worden.

source: JSON telegram configuration
nl: JSON telegram configuratie

source: This allows you to send each reading created to your broker, in JSON format. You can alter the field names used, by changing their name on the right hand side. You may even remove the lines of the fields you wish to omit at all.
nl: Dit stelt je in staat om elke aangemaakte meting naar je broker door te sturen, in JSON-formaat. Je hebt invloed op de naamgeving van de velden, door deze aan de rechterzijde aan te passen. Je kunt ook regels weghalen waarvan je de velden uberhaupt niet wenst te zien.

source: For example, this will format the JSON message to only contain these fields::
nl: Voorbeeld: Dit zorgt ervoor dat het JSON-bericht alleen deze velden bevat::

source: Split topic telegram configuration
nl: Gesplitste topic telegram configuratie

source: This allows you to send each reading created, but splitted in multiple messages. For each field you can designate a separate topic, by changing their path on the right hand side. You can remove the lines of the fields you wish to
nl: Dit stelt je in staat om elke nieuwe meting door te sturen naar je broker, maar in gesplitst formaat over meerdere berichten. Voor elk veld kun je een topic toewijzen waar de waarde naartoe gestuurd kan worden. Verwijder de regels van de velden die je Ã¼berhaupt niet gebruikt om ze uit te schakelen.

source: For example, this will make the application only broadcast these fields to their topics::
nl: Voorbeeld: Dit zorgt ervoor dat de applicatie alleen deze velden doorstuurt naar hun topics::
