Repository: dsmrreader/dsmr-reader
Catalog: docs/locale/*/LC_MESSAGES/settings.po
Languages: nl

source: Other settings
nl: Overige instellingen

source: Some project settings can be changed (or overridden) in the ``dsmrreader/settings.py`` file. Removing any of these settings from your file will force using the default value.
nl: Sommige projectinstellingen kunnen aangepast (of toegevoegd) worden aan het ``dsmrreader/settings.py`` bestand. Het weghalen van deze instellingen zorgt ervoor dat de standaardwaarden weer gebruikt worden.

source: Make sure to reload the application afterwards to persist the changes you've made by executing ``./post-deploy.sh`` or restarting the Supervisor processes.
nl: Zorg ervoor dat je de applicatie herlaadt na je wijzigingen, door ``./post-deploy.sh`` uit te voeren, of de Supervisor-processen te herstarten.

source: Contents
nl: Inhoud

source: The number of seconds the application will sleep after completing a backend run. Prevents hammering on your hardware.
nl: Het aantal seconden dat de applicatie wacht na het voltooien van een backend run. Voorkomt hoge load op je hardware.

source: Defaults to ``DSMRREADER_BACKEND_SLEEP = 1``.
nl: Standaardwaarde ``DSMRREADER_BACKEND_SLEEP = 1``.

source: The number of seconds the application will sleep after reading data from the datalogger (API excluded). Prevents hammering on your hardware.
nl: Het aantal seconden dat de applicatie wacht na het uitlezen van de datalogger (uitgezonderd API). Voorkomt hoge load op je hardware.

source: Defaults to ``DSMRREADER_DATALOGGER_SLEEP = 0.5``.
nl: Standaardwaarde ``DSMRREADER_DATALOGGER_SLEEP = 0.5``.

source: The number of seconds the application will sleep after reading and publishing the outgoing MQTT message queue. Prevents hammering on your hardware.
nl: Het aantal seconden dat de applicatie wacht na het verwerken van een batch uitgaande MQTT-berichten. Voorkomt hoge load op je hardware.

source: Defaults to ``DSMRREADER_MQTT_SLEEP = 1``.
nl: Standaardwaarde: ``DSMRREADER_MQTT_SLEEP = 1``.

source: Whether telegrams are logged, in base64 format. Only required for debugging.
nl: Geeft aan of telegrammen gelogd worden, in base64-formaat. Alleen nodig voor debuggen.

source: Defaults to ``DSMRREADER_LOG_TELEGRAMS = False``.
nl: Standaardwaarde ``DSMRREADER_LOG_TELEGRAMS = False``.

source: Whether the backend process (and datalogger) reconnects to the DB after each run. Prevents some hanging connections in some situations.
nl: Geeft aan of de backend na elke run opnieuw moet verbinden naar de database. Dit voorkomt in enkele gevallen hangende verbindingen.

source: Defaults to ``DSMRREADER_RECONNECT_DATABASE = True``.
nl: Standaardwaarde ``DSMRREADER_RECONNECT_DATABASE = True``.

source: Maximum interval in minutes allowed since the latest reading, before ringing any alarms.
nl: Maximale toegestane interval, in minuten, sinds de laatste meting, voordat er alarmbellen af gaan.

source: Defaults to ``DSMRREADER_STATUS_READING_OFFSET_MINUTES = 60``.
nl: Standaardwaarde ``DSMRREADER_STATUS_READING_OFFSET_MINUTES = 60``.

source: Number of queued MQTT messages the application will retain. Any excess will be purged.
nl: Het aantal MQTT-berichten dat de applicatie vasthoudt. Alle overtollige berichten worden verwijderd.

source: Defaults to ``DSMRREADER_MQTT_MAX_MESSAGES_IN_QUEUE = 100``.
nl: Standaardwaarde: ``DSMRREADER_MQTT_MAX_MESSAGES_IN_QUEUE = 100``.

source: The maximum number of hours that will be cleaned up during one retention run. Raise this value if you have a lot of readings to clean up and it takes too long.
nl: Het maximum aantal uren dat per keer opgeschoond wordt met retentie. Verhoog deze waarde wanneer je een hoop metingen hebt om op te schonen en het erg lang duurt.

source: Defaults to ``DSMRREADER_RETENTION_MAX_CLEANUP_HOURS_PER_RUN = 24``.
nl: Standaardwaarde ``DSMRREADER_RETENTION_MAX_CLEANUP_HOURS_PER_RUN = 24``.

source: Sets the maximum hour of the day that retention will run. Retention always starts after midnight, when enabled. I.e.: changing it to ``8`` will prevent new retention runs after 8 A.M.
nl: Stelt de maximumtijd in waarop retentie op een dag mag draaien. Retentie draait altijd vanaf middernacht, mits ingeschakeld. Bijvoorbeeld: een waarde van ``8`` zorgt ervoor dat retentie niet meer wordt gestart ná 8 uur in de ochtend.

source: Defaults to ``DSMRREADER_RETENTION_UNTIL_THIS_HOUR = 6``.
nl: Standaardwaarde ``DSMRREADER_RETENTION_UNTIL_THIS_HOUR = 6``.

source: :doc:`More information about this feature can be found here<plugins>`.
nl: :doc:`Meer informatie over deze feature kun je hier terugvinden<plugins>`.

source: Defaults to ``DSMRREADER_PLUGINS = []``.
nl: Standaardwaarde ``DSMRREADER_PLUGINS = []``.

source: Whether to override (disable) capabilities. Only use if you want to disable a capability that your smart meter keeps reporting. For example you've switched from using gas to an alternative energy source. Or your smart meter contains electricity returned data, but you do not own any solar panels.
nl: Geeft aan om 'capabilities' van de applicaties uit te schakelen. Gebruik dit alleen wanneer je iets wilt uitschakelen wat je blijft terugkomen in je slimme meter. Bijvoorbeeld wanneer je gewisseld bent van gas naar een alternatieve energiebron. Of wanneer je slimme meter data bevat voor teruggeleverde energie en je uberhaupt geen zonnepanelen hebt.

source: Defaults to ``DSMRREADER_DISABLED_CAPABILITIES = []``.
nl: Standaardwaarde ``DSMRREADER_DISABLED_CAPABILITIES = []``.

source: Example usage ``DSMRREADER_DISABLED_CAPABILITIES = ['gas', 'electricity_returned']``.
nl: Voorbeeldgebruik ``DSMRREADER_DISABLED_CAPABILITIES = ['gas', 'electricity_returned']``.
